{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Master of Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2019-2020",
      "school_name": "University of Waterloo"
    },
    {
      "awards_achievements": null,
      "degree": "Master of Science",
      "department": "Information and Communication Engineering",
      "duration": "2010-2013",
      "school_name": "Tribhuvan University, Nepal"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KailashKhadka",
  "highlighted_projects": [
    {
      "description": "Conducted exploration, analysis, and classification of the dataset using traditional machine learning and deep learning approaches and compared performance and classification results.",
      "git_url": null,
      "name": "Feature Extraction and Classification on Fashion MNIST Image Dataset"
    },
    {
      "description": "Implemented cascaded CNN model to detect license plate with high accuracy and fast speed followed by holistic CNN structure for recognition of detected license plates with an overall accuracy of 98% on CCPD parking dataset containing a wide variety of license plates; total 250k images",
      "git_url": null,
      "name": "License Plate Detection and Recognition using Joint CNNs"
    },
    {
      "description": "Designed and developed a web-based interactive visualization application using R Shiny library to apply exploratory data analysis including data cleaning, manipulation, visualization and statistical tests.",
      "git_url": null,
      "name": "R Shiny App for Exploration, Analysis, and Visualization of a Dataset"
    },
    {
      "description": "Designed a multi-threaded Linux program using MINISAT solver library to solve minimum vertex cover problem to find locations such that a minimum number of street cameras could be installed to achieve full coverage of a network of roads.",
      "git_url": null,
      "name": "Minimum Vertex Cover for Street Camera Deployment"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed and implemented a Linux Cluster Administration (LCA) system that manages a cluster of nodes running CentOS 7 and periodically monitors and logs hardware specification and data usage of each node in an RDBMS database. Created and used a VM instance in GCP and implemented in docker engine and PostgreSQL with bash scripting.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Not Started",
        "JDBC App: Not Started",
        "Grep App: Implemented a Java application that searches for a text pattern recursively in a given directory, and outputs matched lines to a file. This application implements a Java interface, uses libraries like java.io, java.util, and java.slf4j for logging. This project was written in Intellij IDEA with Maven project management and deployed on a docker engine."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlaytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Kailash Khadka",
  "others": [
    {
      "bullets": [
        "Chess player",
        "Drone Hobbyist",
        "Volunteer, Red Cross Society, Nepal: Blood Donation Program, 2012, 2014",
        "Volunteer, Let's Share Forum, Nepal: Earthquake relief operations, 2015",
        "Volunteer, First Robotics Competition, Waterloo, Canada, 2019",
        "Emergency First Aid CPR/AED Level C Certification"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "Refactored Alert Ingestor Java application using Scala and Spark data processing engine for a client company. Coded a clustering agent application which monitors system resource usage on a Linux system.",
      "duration": "2021-present",
      "title": "Junior Software Developer"
    },
    {
      "company": "University of Waterloo, Waterloo, ON",
      "description": "Assisted the professor in administering Image Processing and Visual Communications course by guiding the students in the course and projects works, grading assignments and research project reports, and tracking their progress.",
      "duration": "2020",
      "title": "Graduate Teaching Assistant"
    },
    {
      "company": "Odat Engineering Solutions, Nepal",
      "description": "Led the team in installation, testing, and commissioning of electrical equipment and systems (SCADA, Protection Systems, Local Control Units, and Power Line Carrier Communication Systems. Prepared daily, weekly, and monthly reports and monitored and executed Workplace Health and Safety Program.",
      "duration": "2016-2018",
      "title": "Commissioning Engineer"
    },
    {
      "company": "BhoteKoshi Power Company, Nepal",
      "description": "Conducted operation of 45 MW hydropower plant under standard operating procedures and Led the maintenance team for troubleshooting, repair, testing, calibration, configuration and maintenance of instrumentation, computer, electronic \u0026 electrical equipment to ensure uninterrupted power production.",
      "duration": "2012-2016",
      "title": "O\u0026M Engineer"
    },
    {
      "company": "Tribhuvan University, Kathmandu, Nepal",
      "description": "Conducted classes, tutorials, and lab activities for Digital Logic, and Microprocessor and Assembly Language Programming along with final year major project supervisions.",
      "duration": "2010-2012",
      "title": "Lecturer"
    }
  ],
  "skills": {
    "competent": [
      "C++",
      "MATLAB",
      "Data Analysis [R, SPSS]",
      "Machine Learning Packages [TensorFlow, Keras, ScikitLearn, NLTK]",
      "Python Libraries [Numpy, Scipy, Pandas, Matplotlib, Pyplot, Seaborn]"
    ],
    "familiar": [
      "Docker",
      "GCP",
      "Google Colab",
      "Kaggle",
      "OpenCV",
      "Dronekit",
      "Raspberry Pi",
      "PLC, RSLlogix, SCADA"
    ],
    "proficient": [
      "Java",
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "A recent graduate from the University of Waterloo with a specialization in AI and Machine Learning. Was a teacher, had been an engineer, now an aspiring Software Engineer but always a student. A tech guy who loves to tinker with software and hardware equally. Passionate about developing smart solutions to problems. Looking to contribute to the growth of my employers while growing alongside."
}
